{
    "label" : "en",
    "btnLangue" : "Language",
    "btnTheme" : "Theme",
    "hautDePage" : "back to top",
    "codeSource" : "I created this website by myself, the source code is",
    "libreAccesGithub" : "freely accessible on Github.",
    "texteInfobulleAge" : "born on June 24, 1997",
    "age" : "<i class=\"fas fa-birthday-cake\"></i> &nbsp; age <span id=\"nombreAge\">22</span>",
    "nationalite" : "<i class=\"fas fa-flag\"></i> &nbsp; French ",
    "lienEmail" : "Send me an email",
    "lienProfilLinkedin" : "Go to my Linkedin profile",
    "lienProfilGitlab" : "Go to my GitLab profile",
    "lienProfilGithub" : "Go to my Github profile",
    "titrePageTop" : "Page top",
    "titreAPropos" : "About me",
    "titreProgrammes" : "Programs",
    "titreRecherche" : "Research",
    "titreParcours" : "Past experiences",
    "titreCompetences" : "Skills",
    "navTitreNCTU" : "Chiao Tung University",
    "navTitreTSE" : "Télécom Saint-Etienne",
    "navTitreISM" : "Sainte-Marie d'Antony",
    "paragAPropos" : "I like coffee, computers and saucisson, discovering hidden places and learning new languages, History, (black) chocolate and hiking. <br><br> I met computer science at high school while programming games on my calculator, and I decided to make it my job. Proudly en route to becoming a CS engineer, I discovered research on my way, which changed my plans... <br><br> This site gives some information about me and shows some of my projects and my research.",
    "titreNCTU" : "National Chiao Tung University, Hsinchu, Taïwan",
    "paragNCTU" : "I always wanted to study abroad, and I had the opportunity to do it for one year thanks to an academic exchange semester at National Chiao Tung University. This was followed by a 6 month research internship in the Information Theory laboratory of that same university, which led to the publication of papers at two conferences.<br><br><a href=\"https://www.nctu.edu.tw/\">National Chiao Tung University</a> is a public taiwanese university, located in Hsinchu, Taiwan. Founded in 1896 in Shanghai by an imperial edict of Emperor Guangxu, it was re-established in Hsinchu by former students and teachers in 1958. It is the third best university in the country, and is in the top 50 of the world's best universities for engineering and computer science according to the Shanghai ranking.",
    "titreTSE" : "Télécom Saint-Etienne, Saint-Etienne, France",
    "paragTSE" : "After passing the exams at the end of preparatory school, I joined Télécom Saint-Etienne engineering school. There, I could finally learn about Computer Science in detail. It is also there that I had a first contact with research, through an internship and conversations with my professors. <br><br> <a href=\"https://www.telecom-st-etienne.fr/\">Télécom Saint-Etienne</a> is an engineering school located in Saint-Etienne City, France. Created in 1991 by Jean Monnet University, it is officially approved by the Commission des Titres d'Ingénieurs (the commission certifying the ability for engineering schools to deliver engineer diplomas) and is part of the Mines-Télécom Institute. The environment it represents for its students brings them into contact with the world of entrepreneurship as well as research or design.",
    "titreISM" : "Institution Sainte-Marie, Antony, France",
    "paragISM" : "Having freshly obtained the baccalaureate, I entered the preparatory classes (\"prépa\") at Sainte-Marie d'Antony. I followed a MPSI-MP track (Maths-Physics), where I studied intensively mathematics, and physics and computer science too (I already had learned a lot about CS by myself). <br><br> <a href=\"https://www.saintemarieantony.fr/prepas\">Sainte-Marie d'Antony</a> Institution, created in 1897 by marianists, is a private educational institution located in Antony, in the suburbs of Paris. Despite its small number of students, its MP track is ranked 37th among the CPGEs in France.",
    "paragPrepas" : "The <span style=\"font-style:italic;\">classes préparatoires aux grandes écoles</span> (CPGE) are higher education courses. Their purpose is to prepare students for the competitive exams of the <span style=\"font-style:italic;\">grandes écoles</span>. <br> Considered as very selective, the workload is one of the highest in Europe",
    "telechCV" : "<i class=\"far fa-file-pdf\"></i> See my resume",
    "travauxProjets" : "My works and projects",
    "lienTravauxProjetsInfobulle" : "See my works and projects",
    "domainesCompetences" : "My fields of expertise",
    "compMaths" : "Mathematics",
    "compInfo" : "Computer Science",
    "compML" : "Machine Learning",
    "compImage" : "Image Processing",
    "compWeb" : "Web Development",
    "compLogiciel" : "Software Engineering",
    "outilsMaitrises" : "Mastered tools and software",
    "catOutilsScript" : "Scripting languages",
    "catOutilsBasNiv" : "Standard programming languages",
    "catOutilsWeb" : "Web",
    "catOutilsLogiciel" : "Software developing tools",
    "catOutilsAutres" : "Other",
    "languesParlees" : "Languages",
    "langueFR" : "French",
    "nivLangFR" : "native",
    "langueEN" : "English",
    "nivLangEN" : "fluent",
    "langueIT" : "Italian",
    "nivLangIT" : "fluent",
    "languezht" : "Chinese (traditional)",
    "nivLangZHT" : "basic",
    "langueZHS" : "Chinese (simplified)",
    "nivLangZHS" : "basic",
    "langueES" : "Spanish",
    "nivLangES" : "intermediate",
    "langueJP" : "Japanese",
    "nivLangJP" : "beginner",
    "languePL" : "Polish",
    "nivLangPL" : "beginner",
    "presentationPanneauProgrammes" : "This page features programs that I wrote, alone or within a group, in various contexts. I selected the easiest to use or to adapt and re-use.",
    "btnProgDemo" : "Demo",
    "btnProgCode" : "Code",
    "licenseMIT" : "licensed under MIT license",
    "licenseUnlicense" : "licensed under The Unlicense",
    "btnProgPresentation" : "Presentation",
    "progTitreSpaceInvaders" : "Space invaders",
    "progSousTitreSpaceInvaders" : "Web game",
    "progTexteSpaceInvaders" : "This game is adapted from a school project I did during my 2nd year in TSE.<br> The goal is to destroy the spacecrafts coming to the player from the screen top with growing speed and endurance. For every spacecraft reaching the screen bottom, the player loses one of his/her 10 life points.",
    "progTitreGenMots" : "Word generator",
    "progSousTitreGenMots" : "Java program",
    "progTexteGenMots" : "This program was made in a few hours with a friend, for fun.<br>It can generate words \"resembling\" those of a language, thanks to basic statistical data about that language. It can easily be adapted to generate words from a fictional language.",
    "progTitreVisuFctCout" : "Visualisation of the loss function of a neural network",
    "progSousTitreVisuFctCout" : "Coded in Python with Tensorflow",
    "progTexteVisuFctCout" : "This is a group project I made during my exchange semester at Chiao Tung University. Based on a method exposed in <a href=\"https://arxiv.org/pdf/1712.09913.pdf\">this paper</a>, one can visualise in 3D the «landscape» formed by a neural network's loss function.<br> We used that to visualise the impact of certain architectures or practices of neural networks development (regularisation, network's depth, etc.) on the shape of the loss function.",
    "progTitreTraductionJS" : "Web page translation",
    "progSousTitreTraductionJS" : "Javascript",
    "progTexteTraductionJS" : "I made that tool as a part of this site. You can try it now with the button in the upper-right corner or the \"demo\" button.<br>You can use it to make a web page easily translated to one or more languages, and to automatically adapt it to the browser's default language.",
    "progTitreCasseBriques" : "Breakout game with optic command",
    "progSousTitreCasseBriques" : "C++ game using OpenCV",
    "progTexteCasseBriques" : "A version of the famous game in which your goal is to hit bricks with a ball. Here, the bat used to hit the ball is commanded by the player's moves in front of the computer's camera. <br> It was a pair project in TSE, which goal was to use OpenCV library."
} 
