{
    "label" : "fr",
    "btnLangue" : "Langue",
    "btnTheme" : "Thème",
    "hautDePage" : "haut de page",
    "codeSource" : "Ce site a été développé par moi-même, le code source est",
    "libreAccesGithub" : "en libre accès sur Github.",
    "texteInfobulleAge" : "né le 24 juin 1997",
    "age" : "<i class=\"fas fa-birthday-cake\"></i> &nbsp; <span id=\"nombreAge\">22</span> ans",
    "localisation" : "<i class=\"fas fa-location-dot\"></i> &nbsp; Taipei, Taïwan",
    "nationalite" : "<i class=\"fas fa-flag\"></i> &nbsp; français ",
    "lienEmail" : "Envoyez-moi un email",
    "lienProfilLinkedin" : "Aller sur mon profil Linkedin",
    "lienProfilGithub" : "Aller sur mon profil Github",
    "lienProfilGitlab" : "Aller sur mon profil GitLab",
    "lienProfilYoutube" : "Aller sur ma chaîne YouTube",
    "titrePageTop" : "Haut de page",
    "titreAPropos" : "A propos de moi",
    "lienAPropos"  : "A propos de moi",
    "titreProgrammes" : "Programmes",
    "titreRecherche" : "Recherche",
    "titreParcours" : "Mon parcours",
    "titreCompetences" : "Compétences",
    "paragAPropos" : "J'ai découvert l'informatique au lycée (en programmant des jeux sur ma calculatrice), et je me suis immédiatement passionné pour la discipline. Par la suite je me suis donc engagé dans des études d'ingénieur en informatique. Au fur et à mesure de mon parcours, je me suis tourné de plus en plus vers la recherche, et je veux maintenant travailler. <br><br> Je m'intéresse en particulier à l'apprentissage automatique et à la science des données. <br><br> Mes autres intérêts comprennent les langues et la géographie (j'ai réalisé <a href=\"https://www.youtube.com/channel/UCKqYnxWHqLjQuHo5OwTeqtw\">quelques vidéos</a> sur le sujet). <br><br> En dehors de cela j'aime faire de la randonnée et voyager.",
    "paragAppier" : "Après mon premier séjour à Taïwan, j'ai voulu y retourner. J'ai donc trouvé un emploi comme ingénieur logiciel auprès de <a href='https://www.appier.com' target='_blank'>Appier</a>, une entreprise taïwanaise qui utilise le Machine Learning pour assister ses clients dans leurs campagnes publicitaires.",
    "titreNCTU" : "Université Nationale Chiao Tung — Hsinchu, Taïwan",
    "paragNCTU" : "Désirant depuis longtemps partir étudier à l'étranger, j'ai pu le faire pour une durée d'un an, en commençant par un semestre d'échange académique à l'Université Chiao Tung. J'ai ensuite enchaîné avec un stage de recherche de 6 mois dans le laboratoire de Théorie de l'Information de cette même université, qui a débouché sur la publication de deux papiers à des conférences.",
    "titreUJM" : "Université Jean Monnet — Saint-Étienne, France",
    "paragUJM" : "Lors de l'été 2018, j'ai effectué un stage de 2 mois au pôle musicologie du <a href='https://www.univ-st-etienne.fr/fr/cierec.html' target='_blank'>CIEREC</a>. Le CIEREC est un laboratoire de l'Université Jean Monnet consacré à l'étude de diverses formes d'art.<br>Mon rôle lors de ce stage était de créer une interface facilitant l'accès et l'analyse d'extraits musicaux, dans le cadre d'un projet visant à définir une méthode pour déterminer une distance entre deux morceaux de musique.",
    "titreTSE" : "Télécom Saint-Etienne — Saint-Etienne, France",
    "paragTSE" : "Ayant passé les concours à l'issue de ma prépa, j'ai intégré l'école d'ingénieurs Télécom Saint-Etienne. C'est à cette occasion que j'ai pu accélérer mon apprentissage de l'informatique sous ses divers aspects. J'y ai aussi eu, par le biais d'un stage et de conversations avec des professeurs, un premier contact avec la recherche universitaire. <br><br> <a href='https://www.telecom-st-etienne.fr' target='_blank'>Télécom Saint-Etienne</a> est une école d'ingénieurs située dans la ville de Saint-Etienne, en France. Créée en 1991 par l'Université Jean Monnet, elle est agréée par la Commission des Titres d'Ingénieurs et est une école affiliée de l'Institut Mines-Télécom. L'environnement qu'elle représente pour ses étudiants les met en contact aussi bien avec le monde de l'entreprenariat qu'avec celui de la recherche et du design.",
    "paragInspire" : "La junior-entreprise de Télécom Saint-Étienne, <a href='https://inspire-telecom.com/' target='_blank'>Inspire</a>, propose aux étudiants de travailler comme consultants pour des clients extérieurs. Pendant un an, j'ai donc travaillé à temps partiel sur un projet de plate-forme web de recrutement.",
    "paragOrdissimo" : "Lors de ma première année à TSE j'ai effectué un stage d'un mois à <a href='https://www.ordissimo.fr' target='_blank'>Ordissimo</a> en programmation web. Mes tâches consistaient à participer à l'amélioration de la plate-forme destinée aux clients de l'entreprise, ainsi qu'au développement d'une interface de back-office.",
    "titreISM" : "Institution Sainte-Marie — Antony, France",
    "paragISM" : "Le bac fraîchement obtenu, voulant me diriger vers les sciences, j'ai intégré les classes préparatoires de Sainte-Marie d'Antony. Ayant suivi une filière MPSI-MP (Maths-Physique), j'y ai appris intensivement les mathématiques, et dans une moindre mesure la physique et l'informatique (dans laquelle j'avais déjà acquis de larges connaissances en autodidacte). <br><br> L'<a href='https://www.saintemarieantony.fr/prepas' target='_blank'>Institution Sainte-Marie d'Antony</a>, créée en 1897 par des marianistes, est un établissement privé d'enseignement situé à Antony, en banlieue parisienne. Malgré son petit effectif, sa filière MP est classée 37ème parmi les CPGE de France.",
    "paragPrepas" : "Les classes préparatoires aux grandes écoles (CPGE) sont des filières d'enseignement supérieur. Hébergées généralement dans des lycées, elles ont pour but de préparer les étudiants aux concours des grandes écoles. <br> Considérées comme hautement exigentes et sélectives, la compétitivité des concours auxquels les CPGE emmènent leur étudiants les pousse à exiger de ceux-ci une charge de travail parmi les plus hautes d'Europe.",
    "telechCV" : "<i class=\"far fa-file-pdf\"></i> Consulter le CV",
    "travauxProjets" : "Mes travaux et projets",
    "lienTravauxProjetsInfobulle" : "Voir mes travaux et mes projets",
    "domainesCompetences" : "Mes domaines d'intérêt",
    "compMaths" : "Mathématiques",
    "compInfo" : "Informatique",
    "compML" : "Machine Learning",
    "compImage" : "Traitement d'image",
    "compWeb" : "Développement Web",
    "compLogiciel" : "Génie Logiciel",
    "outilsMaitrises" : "Outils et logiciels maîtrisés",
    "catOutilsProg" : "Langages de programmation",
    "catOutilsBDD" : "Bases de données",
    "catOutilsCloud" : "Services Cloud",
    "catOutilsBibliotheques" : "Bibliothèques",
    "catOutilsGenieLog" : "Génie logiciel",
    "catOutilsDivers" : "Autres",
    "detOutilsDivers" : "Linux, montage vidéo, graphisme",
    "languesParlees" : "Langues",
    "langueFR" : "Français",
    "nivLangFR" : "C2, langue maternelle",
    "langueEN" : "Anglais",
    "nivLangEN" : "C2, courant",
    "certifLangueEN" : "IELTS band 8.5, C2 certifié",
    "langueIT" : "Italien",
    "nivLangIT" : "C1, courant",
    "languezht" : "Chinois (traditionnel)",
    "nivLangZHT" : "A2, basique",
    "langueZHS" : "Chinois (simplifié)",
    "nivLangZHS" : "A2, basique",
    "langueES" : "Espagnol",
    "nivLangES" : "B2, intermédiaire",
    "langueJP" : "Japonais",
    "nivLangJP" : "A1, débutant",
    "languePL" : "Polonais",
    "nivLangPL" : "A1, débutant",
    "presentationPanneauProgrammes" : "Cette page présente des programmes que j'ai écrits, seul ou en groupe, et dans différents contextes. J'ai sélectionné ceux qui peuvent le plus facilement être utilisés ou repris.",
    "btnProgProjetA4" : "Projet",
    "btnProgDemoSpace" : "Démo",
    "btnProgCodeA4" : "Code",
    "btnProgCodeSMS" : "Code",
    "btnProgCodeGen" : "Code",
    "btnProgCodePresNN" : "Code",
    "btnProgCodeBiblio" : "Code",
    "btnProgCodeSpace" : "Code",
    "btnProgResultatFedLearn" : "Résultats",
    "btnProgCodeFedLearn" : "Code",
    "progTitreFedLearn" : "Expériences sur l'apprentissage fédéré",
    "progSousTitreFedLearn" : "Python avec PyTorch",
    "progTexteFedLearn" : "Les réseaux de neurones fédérés ont vu se développer des techniques permettant à plusieurs acteurs d'entraîner des réseaux de neurones en commun sans partager leurs données avec les autres acteurs. Dans ce projet j'ai voulu mener quelques expériences sur ces nouvelles techniques. J'ai regroupé et analysé les résultats dans un rapport Datastudio.",
    "btnProgPresentation" : "Présentation",
    "btnProgProjetSMS" : "Projet",
    "progTitreSMSDataviz" : "Visualisation de données SMS",
    "progSousTitreSMSDataviz" : "Javascript - Chart.js",
    "progTexteSMSDataviz" : "Ce projet permet de visualiser des statistiques d'utilisation de SMS personnels à partir d'une sauvegarde. Il se base sur la bibliothèque <a href='https://www.chartjs.org/'>Chart.js</a> pour afficher les graphiques.",
    "progTitreConvA4" : "Convertisseur mètres - format papier",
    "progSousTitreConvA4" : "Programme Javascript",
    "progTexteConvA4" : "Cet outil permet de convertir des longueurs métriques en la dimension de papier série A la plus proche.<br>L'inspiration m'est venue de <a href='https://www.youtube.com/watch?v=pUF5esTscZI'>cette vidéo</a>.",
    "progTitreSpaceInvaders" : "Space invaders",
    "progSousTitreSpaceInvaders" : "Jeu web",
    "progTexteSpaceInvaders" : "Ce jeu est adapté d'un petit projet effectué en 2e année d'école à TSE.<br> Le but est de détruire des vaisseaux spatiaux de plus en plus rapides et résistants arrivant vers vous depuis le haut de l'écran. A chaque fois qu'un vaisseau atteint le bas de l'écran, vous perdez un de vos 10 points de vie.",
    "progTitreGenMots" : "Générateur de mots",
    "progSousTitreGenMots" : "Programme Java",
    "progTexteGenMots" : "Ce programme a été réalisé en quelques heures avec un ami, pour le plaisir.<br>Il sert à générer des mots qui \"ressemblent\" à ceux d'une langue donnée, grâce à des données statistiques basiques récoltées sur le langage en question. Il peut facilement être adapté pour créer des mots dans une langue fictive.",
    "progTitreVisuFctCout" : "Visualisation de la fonction de coût d'un réseau de neurones",
    "progSousTitreVisuFctCout" : "Projet codé en Python avec Tensorflow",
    "progTexteVisuFctCout" : "Il s'agit d'un projet effectué en groupe durant mon semestre à l'université Chiao Tung. Sur la base d'une méthode exposée dans <a href=\"https://arxiv.org/pdf/1712.09913.pdf\">ce papier</a>, on peut visualiser en 3D le «paysage» formé par la fonction de coût d'un réseau de neurones.<br> Nous avons utilisé cela pour visualiser l'impact de certaines architectures ou certaines pratiques du développement de réseaux de neurones (régularisation, profondeur du réseau, etc.) sur la forme de la fonction de coût.",
    "progTitreTraductionJS" : "Traduction de page web",
    "progSousTitreTraductionJS" : "Javascript",
    "progTexteTraductionJS" : "J'ai réalisé cet outil lors de la conception de ce site. Vous pouvez le tester avec le bouton en haut à droite.<br>Il permet de rendre facilement une page web traductible dans une ou plusieurs langues, en s'adaptant automatiquement à la langue par défaut du navigateur.",
    "progTitreCasseBriques" : "Casse-briques à commande optique",
    "progSousTitreCasseBriques" : "Jeu en C++ utilisant OpenCV",
    "progTexteCasseBriques" : "Une variante du célèbre jeu où l'on doit envoyer une balle pour casser des briques. Ici, le palet servant à envoyer la balle est commandé par des gestes effectué devant la caméra. <br> Il s'agit d'un projet effectué en binôme à TSE avec pour but l'utilisation de la bibliothèque OpenCV."
}
