{
    "label" : "it",
    "btnLangue" : "Lingua",
    "btnTheme" : "Tema",
    "hautDePage" : "torna all'inizio",
    "codeSource" : "Questo sito è stato sviluppato da io, il codice sorgente è",
    "libreAccesGithub" : "liberamente accessibile su Github.",
    "texteInfobulleAge" : "nato il 24 giugno 1997",
    "age" : "<i class=\"fas fa-birthday-cake\"></i> &nbsp; <span id=\"nombreAge\">22</span> anni",
    "localisation" : "<i class=\"fas fa-location-dot\"></i> &nbsp; Taipei, Taiwan",
    "nationalite" : "<i class=\"fas fa-flag\"></i> &nbsp; francese ",
    "lienEmail" : "Inviami un email",
    "lienProfilLinkedin" : "Andare al mio profilo Linkedin",
    "lienProfilGithub" : "Andare al mio profilo Github",
    "lienProfilGitlab" : "Andare al mio profilo GitLab",
    "lienProfilYoutube" : "Andare al mio canale YouTube",
    "titrePageTop" : "Inizio pagina",
    "titreAPropos" : "Su di me",
    "lienAPropos"  : "Su di me",
    "titreProgrammes" : "Programmi",
    "titreRecherche" : "Ricerca",
    "titreParcours" : "Mio percorso",
    "titreCompetences" : "Competenze",
    "paragAPropos" : "Ho scoperto l'informatica alle superiori (programmando giochi sulla mia calcolatrice) e sono rimasto subito affascinato da questa disciplina. In seguito, ho studiato ingegneria del software.  Mentre andavo avanti, mi sono orientato sempre di più verso la ricerca, che è ciò in cui ora voglio lavorare. <br><br> Sono particolarmente interessato all'apprendimento automatico e alla scienza dei dati. <br><br> Altri miei interessi sono l'apprendimento delle lingue e la geografia (ho realizzato <a href=\"https://www.youtube.com/channel/UCKqYnxWHqLjQuHo5OwTeqtw\">alcuni video</a> su questo soggetto). <br><br> Oltre agli interessi lavorativi, mi piace fare escursioni e viaggiare.",
    "paragAppier" : "Dopo aver studiato a Taiwan, ci sono tornato per iniziare il mio primo lavoro a tempo pieno. Ora lavoro come ingegnere del software e data scientist presso <a href='https://www.appier.com' target='_blank'>Appier</a>, un'azienda taiwanese che utilizza il Machine Learning per assistere i propri clienti nelle campagne pubblicitarie.<br>All'inizio sono entrato a far parte del gruppo di supporto tecnico come specialista dell'estrazione dei dati. Poi ho collaborato con il gruppo di sviluppo software e successivamente con il gruppo di Data Science, con l'obiettivo di analizzare profili di clienti e proporre miglioramenti per le loro strategie di marketing.<br><br><a href='https://www.appier.com' target='_blank'>Appier</a> è una startup taiwanese fondata nel 2012, che nel 2020 è stata la prima nel paese a superare il miliardo di dollari di capitalizzazione di mercato. Oggi conta 500 dipendenti in 17 città dell'Asia.",
    "titreNCTU" : "Università Nazionale Chiao Tung — Hsinchu, Taiwan",
    "paragNCTU" : "Avendo a lungo desiderato andare all'estero per studiare, ho potuto farlo per un periodo di un anno, con un semestre di scambio universitario all'Università Chiao Tung. Dopo questo ho fatto un tirocinio di ricerca di 6 mesi nel Laboratorio di Teoria dell'Informazione della stessa università, che ha portato all publicazione di articoli a due conferenze.<br><br><a href=\"https://www.nctu.edu.tw/\">L'Università Nazionale Chiao Tung</a> è un'università pubblica taiwanese all'avanguardia nella ricerca accademica, situata a Hsinchu, Taiwan. Fondata nel 1896 a Shanghai da un editto imperiale dell'imperatore Guangxu, è stata ristabilita a Hsinchu da ex studenti e professori nel 1958. È la terza università più grande del paese, e si colloca nella top 50 delle migliori università del mondo per l'ingegneria e l'informatica secondo la classifica di Shanghai.",
    "titreUJM" : "Università Jean Monnet — Saint-Étienne, France",
    "paragUJM" : "Nell'estate 2018, ho fatto uno stage di 2 mesi al dipartimento di musicologia del <a href='https://www.univ-st-etienne.fr/fr/cierec.html'>CIEREC</a>. Il CIEREC è un laboratorio dell'Università Jean Monnet dedicato allo studio di varie forme d'arte.<br>Il mio ruolo durante questo stage è stato quello di creare un'interfaccia per facilitare l'accesso e l'analysi di brani musicali, nell'ambito di un progetto inteso a definire un metodo per determinare una distanza tra due brani musicali.",
    "titreTSE" : "Télécom Saint-Etienne — Saint-Etienne, France",
    "paragTSE" : "Dopo aver superato i concorsi di ammissione al termine della <i>prépa</i>, mi sono iscritto alla scuola di ingegneria Télécom Saint-Etienne. È stato lì che ho potuto accelerare il mio apprendimento dell'informatica nei suoi vari aspetti. Ho anche avuto il mio primo contatto con la ricerca universitaria attraverso un tirocinio e conversazioni con i professori. <br> <a href=\"https://www.telecom-st-etienne.fr/\">Télécom Saint-Etienne</a> è una scuola di ingegneria situata nella città di Saint-Etienne, Francia. Creata nel 1991 dall'Università Jean Monnet, è accreditata dalla Commissione dei Titoli d'Ingeniere ed è una scuola affiliata all'Istituto Mines-Télécom. L'ambiente che rappresenta per i suoi studenti li mette in contatto con il mondo dell'imprenditoria e con il mondo della ricerca e del design.",
    "paragInspire" : "La «junior-entreprise» di Télécom Saint-Étienne, <a href='https://inspire-telecom.com/'>Inspire</a>, offre agli studenti la possibilità di lavorare come consulenti per clienti esterni. Così, per un anno, ho lavorato part-time su un progetto di piattaforma web di reclutamento.",
    "paragOrdissimo" : "Durante il mio primo anno a TSE, ho fatto uno stage di un mese a <a href='https://www.ordissimo.fr'>Ordissimo</a> come programmatore web. Mes tâches consistaient à participer al miglioramento della piattaforma clienti dell'azienda, così come lo sviluppo di un'interfaccia di back-office.",
    "titreISM" : "Instituzione Sainte-Marie — Antony, France",
    "paragISM" : "Dopo aver ottenuto il mio baccalaureato, volendo andare nelle scienze, sono entrato nelle classi preparatorie («prépa») di Sainte-Marie d'Antony. Ho seguito un corso di studi Matematica-Fisica, ho studiato intensamente la matematica, e in misura minore la fisica e l'informatica. <br><br> L'<a href='https://www.saintemarieantony.fr/prepas'>Istituzione Sainte-Marie d'Antony</a>, creata nel 1897 da marianisti, è un istituto di istruzione privato situato a Antony, vicino a Parigi.",
    "paragPrepas" : "In Francia, le <span style=\"font-style:italic;\">classes préparatoires aux grandes écoles</span> (CPGE) sono dei corsi di insegnamento a carattere universitario. Le «prépas» preparano in 2 anni gli studenti ai concorsi di ammissione delle <span style=\"font-style:italic;\">Grandes Écoles</span>, cioè gli istituti di livello superiore caratterizzati da un'alta qualità di insegnamento. Agli allievi è quindi richiesto uno studio intensivo e piuttosto teorico, e queste classi sono considerate molto selettive.",
    "telechCV" : "<i class=\"far fa-file-pdf\"></i> Vedere il mio CV",
    "travauxProjets" : "I miei lavori e progetti",
    "lienTravauxProjetsInfobulle" : "Vedere i miei lavori e progetti",
    "domainesCompetences" : "Le mie aree d'interesse",
    "compMaths" : "Matematica",
    "compInfo" : "Informatica",
    "compML" : "Machine Learning",
    "compImage" : "Trattamento di immagini",
    "compWeb" : "Sviluppo Web",
    "compLogiciel" : "Ingegneria del software",
    "outilsMaitrises" : "Strumenti e software",
    "catOutilsProg" : "Linguaggi di programmazione",
    "catOutilsBDD" : "Database",
    "catOutilsCloud" : "Servizi Cloud",
    "catOutilsBibliotheques" : "Librerie di software",
    "catOutilsGenieLog" : "Ingegneria del software",
    "catOutilsDivers" : "Altri",
    "detOutilsDivers" : "Linux, montaggio video, grafica",
    "languesParlees" : "Lingue",
    "langueFR" : "Francese",
    "nivLangFR" : "C2, lingua madre",
    "langueEN" : "Inglese",
    "nivLangEN" : "C2, corrente",
    "certifLangueEN" : "IELTS band 8.5, C2 certificato",
    "langueIT" : "Italiano",
    "nivLangIT" : "C1, corrente",
    "languezht" : "Cinese (tradizionale)",
    "nivLangZHT" : "A2, basico",
    "langueZHS" : "Cinese (semplificato)",
    "nivLangZHS" : "A2, basico",
    "langueES" : "Spagnolo",
    "nivLangES" : "B2, intermedio",
    "langueJP" : "Giapponese",
    "nivLangJP" : "A1, principiante",
    "languePL" : "Polacco",
    "nivLangPL" : "A1, principiante",
    "presentationPanneauProgrammes" : "Questa pagina presenta dei programmi che ho scritto, da solo o in gruppo, e in contesti diversi. Ho selezionato quelli che possono essere utilizzati o ripetuti più facilmente.",
    "btnProgProjetA4" : "Progetto",
    "btnProgDemoSpace" : "Demo",
    "btnProgCodeA4" : "Codice",
    "btnProgCodeSMS" : "Codice",
    "btnProgCodeGen" : "Codice",
    "btnProgCodePresNN" : "Codice",
    "btnProgCodeBiblio" : "Codice",
    "btnProgCodeSpace" : "Codice",
    "btnProgResultatFedLearn" : "Risultati",
    "btnProgCodeFedLearn" : "Codice",
    "progTitreFedLearn" : "Esperimenti sull'apprendimento federato",
    "progSousTitreFedLearn" : "Python con PyTorch",
    "progTexteFedLearn" : "Le reti neurali federate hanno visto lo sviluppo di tecniche che consentono a diversi attori di addestrare reti neurali in comune senza condividere i propri dati con gli altri attori. In questo progetto ho voluto effettuare alcuni esperimenti su queste nuove tecniche. Ho aggregato e analizzato i risultati in un report di Datastudio.",
    "btnProgPresentation" : "Presentazione",
    "btnProgProjetSMS" : "Progetto",
    "progTitreSMSDataviz" : "Visualizzazione dati SMS",
    "progSousTitreSMSDataviz" : "Javascript - Chart.js",
    "progTexteSMSDataviz" : "Questo progetto permette di visualizzare le statistiche di utilizzo degli SMS personali da un backup. Si basa sulla libreria <a href='https://www.chartjs.org/'>Chart.js</a> per visualizzare i grafici.",
    "progTitreConvA4" : "Convertitore metri - formato di carta",
    "progSousTitreConvA4" : "Programma Javascript",
    "progTexteConvA4" : "Questo programma converte le lunghezze metriche nel formato carta della serie A più vicino.<br>L'ispirazione venne da <a href='https://www.youtube.com/watch?v=pUF5esTscZI'>questo video</a>.",
    "progTitreSpaceInvaders" : "Space invaders",
    "progSousTitreSpaceInvaders" : "Gioco web",
    "progTitreGenMots" : "Generatore di parole",
    "progSousTitreGenMots" : "Programma Java",
    "progTexteGenMots" : "Questo programma è stato realizzato in poche ore con un amico, per puro divertimento, e serve a generare parole che \"assomigliano\" a quelle di una determinata lingua, utilizzando dati statistici di base raccolti sulla lingua in questione. Può essere facilmente adattato per creare parole in una lingua di fantasia.",
    "progTitreVisuFctCout" : "Visualizzazione della funzione di costo di una rete neurale",
    "progSousTitreVisuFctCout" : "Progetto scritto in Python con Tensorflow",
    "progTitreTraductionJS" : "Traduzione di pagina web",
    "progSousTitreTraductionJS" : "Javascript",
    "progTitreCasseBriques" : "Clone di Arkanoid a comando ottico",
    "progSousTitreCasseBriques" : "Gioco scritto in C++ utilizzando OpenCV"
} 
